content-org/all-posts.org
#+startup: inlineimages entitiespretty
#+tags: @Tutorials(T) @Articles(A) @Projects(P)
#+tags: hugo(h) networks(n)
#+hugo_base_dir: ../
#+author: jeanjayquitayen


** STARTED Testing Network Speed                                  :networks:
:PROPERTIES:
:EXPORT_DATE: <2023-04-23 Sun>
:EXPORT_FILE_NAME: my-first-post
:END:
We all know how it feels when the network speed is problematic and you constantly get disconnected from the internet.

There are several approach to testing a network depending on the nature of it. Common factors are your ISP's internet speed or you local network.
*** Testing the Internet Speed
There are serveral browser based speedtest tools that can be used to check you internet speed.
 The most commonly used is the speedtest.net.



