content/posts/my-first-post.md
+++
title = "Testing Network Speed"
author = ["jeanjayquitayen"]
date = 2023-04-23T00:00:00+08:00
tags = ["networks"]
categories = ["Tutorials"]
draft = false
+++

We all know how it feels when the network speed is problematic and you constantly get disconnected from the internet.

There are several approach to testing a network depending on the nature of it. Common factors are your ISP's internet speed or you local network.


## Testing the Internet Speed {#testing-the-internet-speed}

There are serveral browser based speedtest tools that can be used to check you internet speed.
 The most commonly used is the speedtest.net.
